---
title: RebarHandlesData
classe: Autodesk.Revit.DB.Structure.RebarHandlesData
namespace: Autodesk.Revit.DB.Structure
eredita: System.Object
revit: "2025"
revitapi: "25.4.30.0"
stato: auto
verbo: leggere
membri_n: 8
---

# RebarHandlesData

!!! note "Scheda automatica"
    La corrispondenza C#→Python è generata dalle 7 Regole. Descrizione, tranello ed esempio sono **da rivedere** — contribuisci.

## La classe

_(una frase: cos'è e a cosa serve)_

## La corrispondenza

| nella doc (C#) | in python | tipo |
|---|---|---|
| `Boolean IsValidObject { get; }` | `rebarHandlesData.IsValidObject` | Boolean |
| `Void AddCustomHandle(Int32)` | `rebarHandlesData.AddCustomHandle(customHandleTag)` | Void |
| `Void Dispose()` | `rebarHandlesData.Dispose()` | Void |
| `IList<Int32> GetCustomHandles()` | `rebarHandlesData.GetCustomHandles()` | IList<Int32> |
| `Int32 GetEndHandle()` | `rebarHandlesData.GetEndHandle()` | Int32 |
| `Int32 GetStartHandle()` | `rebarHandlesData.GetStartHandle()` | Int32 |
| `Void SetEndHandle(Int32)` | `rebarHandlesData.SetEndHandle(endHandleTag)` | Void |
| `Void SetStartHandle(Int32)` | `rebarHandlesData.SetStartHandle(startHandleTag)` | Void |

## Il tranello

_(ciò che la pagina non dice e ti farebbe sbagliare)_

## Lo script

```python
# esempio da completare
```